# **`Lab3 - Data Engineering & EDA with Python, SQL, and Pandas`**

##### **Name** - Manu Mathew
##### **CourseID** - PROG8245
##### **Course** - Machine Learning Programming
##### **Student ID** - 8990691

---

**Install required packages**

In [21]:
%pip install psycopg2-binary pandas faker sqlalchemy

Requirement already satisfied: psycopg2-binary in ./.venv/lib/python3.13/site-packages (2.9.10)
Requirement already satisfied: pandas in ./.venv/lib/python3.13/site-packages (2.2.3)
Requirement already satisfied: faker in ./.venv/lib/python3.13/site-packages (37.3.0)
Requirement already satisfied: sqlalchemy in ./.venv/lib/python3.13/site-packages (2.0.41)
Requirement already satisfied: numpy>=1.26.0 in ./.venv/lib/python3.13/site-packages (from pandas) (2.2.6)
Requirement already satisfied: python-dateutil>=2.8.2 in ./.venv/lib/python3.13/site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in ./.venv/lib/python3.13/site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in ./.venv/lib/python3.13/site-packages (from pandas) (2025.2)
Requirement already satisfied: typing-extensions>=4.6.0 in ./.venv/lib/python3.13/site-packages (from sqlalchemy) (4.14.0)
Requirement already satisfied: six>=1.5 in ./.venv/lib/python3.13/site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Note: you may need to restart the kernel to use updated packages.

`1 -- `
- Create a free SQL Database
- Create a table named employees with the following columns:
    - employee_id (integer, primary key)
    - name (string)
    - position (string, IT-related job titles)
    - start_date (date, between 2015 and 2024)
    - salary (integer, $60,000â€“$200,000)`

I have set up a Postgres database and also I have created the SQL table using the below SQL query

```SQL
CREATE TABLE employees (
  employee_id SERIAL PRIMARY KEY,
  name VARCHAR(50),
  position VARCHAR(50),
  start_date DATE,
  salary INTEGER
);

**Adding the imports**

In [22]:
import random
from faker import Faker
from datetime import date
import pandas as pd
# import psycopg2
from sqlalchemy import create_engine

`2 --`
- Generate & Populate Data
    - Generate at least 50 synthetic records using Python and the Faker library.
    - Insert the data into your cloud database.

In [23]:
# Initializes faker object from the Faker library
fake = Faker()
# Position list that can be assigned randomly to employees
positions = ['Software Engineer', 'Data Analyst', 'DevOps Engineer', 'ML Engineer', 'QA Engineer','Backend Developer', 'Frontend Developer', 'Cloud Architect', 'SysAdmin', 'Data Scientist']
# Running a loop for 100 iterations
for i in range(100):
    # Replace single quote with double quotes
    name = fake.name().replace("'", "''")
    # Select random position for the employee
    position = random.choice(positions)
    # Select any date in the year between 2015 and 2024
    start_date = fake.date_between(start_date=date(2015,1,1), end_date=date(2024,6,1))
    # Select an integer between 60000 and 200000
    salary = random.randint(60000, 200000)
    # print 100 SQL insert queries
    print(f"INSERT INTO employees (name, position, start_date, salary) VALUES('{name}', '{position}', '{start_date}', {salary});")

INSERT INTO employees (name, position, start_date, salary) VALUES('Jonathan Yoder', 'ML Engineer', '2017-05-02', 74310);
INSERT INTO employees (name, position, start_date, salary) VALUES('Juan Johnson', 'Frontend Developer', '2017-07-21', 88897);
INSERT INTO employees (name, position, start_date, salary) VALUES('Kaitlyn Townsend', 'DevOps Engineer', '2019-12-20', 146345);
INSERT INTO employees (name, position, start_date, salary) VALUES('Justin Smith', 'DevOps Engineer', '2021-12-27', 75305);
INSERT INTO employees (name, position, start_date, salary) VALUES('Miguel Jones', 'Software Engineer', '2019-04-09', 107147);
INSERT INTO employees (name, position, start_date, salary) VALUES('Bobby Kemp', 'ML Engineer', '2024-04-10', 155292);
INSERT INTO employees (name, position, start_date, salary) VALUES('Joseph Hart', 'Backend Developer', '2023-07-06', 141864);
INSERT INTO employees (name, position, start_date, salary) VALUES('Ricky Ward', 'Frontend Developer', '2024-03-18', 67901);
INSERT INTO employees (name, position, start_date, salary) VALUES('Elizabeth Heath', 'Cloud Architect', '2015-01-25', 198508);
INSERT INTO employees (name, position, start_date, salary) VALUES('Eddie Hernandez', 'SysAdmin', '2016-07-13', 186920);
INSERT INTO employees (name, position, start_date, salary) VALUES('Marissa Elliott', 'ML Engineer', '2017-10-01', 190402);
INSERT INTO employees (name, position, start_date, salary) VALUES('Brian Ali', 'Frontend Developer', '2020-04-23', 159684);
INSERT INTO employees (name, position, start_date, salary) VALUES('Cassandra Spence', 'Backend Developer', '2024-02-12', 127434);
INSERT INTO employees (name, position, start_date, salary) VALUES('Frank Williams', 'Software Engineer', '2023-10-19', 190361);
INSERT INTO employees (name, position, start_date, salary) VALUES('Robert Taylor', 'QA Engineer', '2017-12-31', 101623);
INSERT INTO employees (name, position, start_date, salary) VALUES('Lori Cruz', 'ML Engineer', '2018-07-22', 82705);
INSERT INTO employees (name, position, start_date, salary) VALUES('Walter Greene', 'SysAdmin', '2017-08-25', 97907);
INSERT INTO employees (name, position, start_date, salary) VALUES('Nicholas Jacobs', 'ML Engineer', '2022-08-12', 154130);
INSERT INTO employees (name, position, start_date, salary) VALUES('Donald Durham', 'QA Engineer', '2015-04-12', 76716);
INSERT INTO employees (name, position, start_date, salary) VALUES('Kayla Summers', 'SysAdmin', '2020-02-02', 93399);
INSERT INTO employees (name, position, start_date, salary) VALUES('Brianna Alvarado', 'Data Analyst', '2015-03-01', 195678);
INSERT INTO employees (name, position, start_date, salary) VALUES('Linda Cooper', 'Frontend Developer', '2015-07-31', 107616);
INSERT INTO employees (name, position, start_date, salary) VALUES('Jennifer Garner', 'Frontend Developer', '2019-05-31', 175487);
INSERT INTO employees (name, position, start_date, salary) VALUES('Dr. Laura Edwards DVM', 'Backend Developer', '2019-05-26', 89706);
INSERT INTO employees (name, position, start_date, salary) VALUES('Thomas Shepherd', 'Backend Developer', '2021-03-11', 73634);
INSERT INTO employees (name, position, start_date, salary) VALUES('April Johnston', 'Data Scientist', '2016-05-29', 85363);
INSERT INTO employees (name, position, start_date, salary) VALUES('Joanna Joseph', 'Frontend Developer', '2022-04-02', 69444);
INSERT INTO employees (name, position, start_date, salary) VALUES('Terri Phillips', 'ML Engineer', '2018-07-20', 187014);
INSERT INTO employees (name, position, start_date, salary) VALUES('Charles Scott', 'Cloud Architect', '2016-12-29', 196609);
INSERT INTO employees (name, position, start_date, salary) VALUES('Ryan Richard', 'Data Scientist', '2018-09-06', 196388);
INSERT INTO employees (name, position, start_date, salary) VALUES('Cindy Morris', 'Software Engineer', '2021-11-29', 89464);
INSERT INTO employees (name, position, start_date, salary) VALUES('Trevor Torres', 'DevOps Engineer', '2018-07-14', 101974);
INSERT INTO employees (name, position, start_date, salary) VALUES('Nicholas Clayton MD', 'Software Engineer', '2023-11-14', 175601);
INSERT INTO employees (name, position, start_date, salary) VALUES('Laura Perez', 'SysAdmin', '2019-01-25', 91148);
INSERT INTO employees (name, position, start_date, salary) VALUES('Luis Garcia', 'QA Engineer', '2021-12-03', 128136);
INSERT INTO employees (name, position, start_date, salary) VALUES('Tommy Harris', 'QA Engineer', '2017-06-26', 191110);
INSERT INTO employees (name, position, start_date, salary) VALUES('Robert Weber', 'Software Engineer', '2016-03-19', 69103);
INSERT INTO employees (name, position, start_date, salary) VALUES('Karen Harris', 'Data Analyst', '2021-01-22', 80845);
INSERT INTO employees (name, position, start_date, salary) VALUES('Alison Medina', 'Software Engineer', '2019-04-03', 72086);
INSERT INTO employees (name, position, start_date, salary) VALUES('Joe Fox', 'Frontend Developer', '2015-09-08', 187761);
INSERT INTO employees (name, position, start_date, salary) VALUES('Matthew Kramer', 'Data Scientist', '2020-01-20', 149953);
INSERT INTO employees (name, position, start_date, salary) VALUES('Shelly Galvan', 'DevOps Engineer', '2016-09-28', 70692);
INSERT INTO employees (name, position, start_date, salary) VALUES('Lindsey White', 'DevOps Engineer', '2022-09-10', 96555);
INSERT INTO employees (name, position, start_date, salary) VALUES('Gabrielle Thomas', 'Frontend Developer', '2021-11-29', 69359);
INSERT INTO employees (name, position, start_date, salary) VALUES('Joshua Turner', 'Frontend Developer', '2017-08-31', 112694);
INSERT INTO employees (name, position, start_date, salary) VALUES('Michael Vang', 'Data Scientist', '2021-02-20', 115970);
INSERT INTO employees (name, position, start_date, salary) VALUES('Mary Moreno', 'QA Engineer', '2023-07-02', 132727);
INSERT INTO employees (name, position, start_date, salary) VALUES('Anthony Hill', 'SysAdmin', '2022-08-23', 96354);
INSERT INTO employees (name, position, start_date, salary) VALUES('Corey Hamilton', 'Data Analyst', '2019-12-29', 196741);
INSERT INTO employees (name, position, start_date, salary) VALUES('Todd Kennedy', 'Frontend Developer', '2024-02-14', 181591);
INSERT INTO employees (name, position, start_date, salary) VALUES('Carlos Lane', 'DevOps Engineer', '2022-07-05', 193142);
INSERT INTO employees (name, position, start_date, salary) VALUES('Cassandra Welch', 'DevOps Engineer', '2015-04-07', 80665);
INSERT INTO employees (name, position, start_date, salary) VALUES('Deborah Mendoza', 'DevOps Engineer', '2022-01-04', 158341);
INSERT INTO employees (name, position, start_date, salary) VALUES('Danny Ballard', 'QA Engineer', '2023-10-16', 79909);
INSERT INTO employees (name, position, start_date, salary) VALUES('Brian Williams', 'SysAdmin', '2023-04-18', 74432);
INSERT INTO employees (name, position, start_date, salary) VALUES('Peter Smith', 'DevOps Engineer', '2022-12-06', 138633);
INSERT INTO employees (name, position, start_date, salary) VALUES('Johnny King', 'DevOps Engineer', '2015-10-07', 86297);
INSERT INTO employees (name, position, start_date, salary) VALUES('Randy Garza', 'Software Engineer', '2021-12-19', 107611);
INSERT INTO employees (name, position, start_date, salary) VALUES('Joseph Oliver', 'Cloud Architect', '2023-09-22', 69232);
INSERT INTO employees (name, position, start_date, salary) VALUES('Cathy Gardner', 'Backend Developer', '2016-07-04', 157426);
INSERT INTO employees (name, position, start_date, salary) VALUES('Johnny Stevenson', 'Frontend Developer', '2018-05-18', 67447);
INSERT INTO employees (name, position, start_date, salary) VALUES('Erin Washington', 'Frontend Developer', '2019-12-03', 146727);
INSERT INTO employees (name, position, start_date, salary) VALUES('Angela Reed', 'Data Analyst', '2020-04-10', 160496);
INSERT INTO employees (name, position, start_date, salary) VALUES('Tonya Fischer', 'Software Engineer', '2017-08-04', 155998);
INSERT INTO employees (name, position, start_date, salary) VALUES('Daniel Ritter', 'Data Scientist', '2018-01-24', 132054);
INSERT INTO employees (name, position, start_date, salary) VALUES('Dakota Prince', 'Backend Developer', '2022-10-14', 165741);
INSERT INTO employees (name, position, start_date, salary) VALUES('David Deleon', 'Cloud Architect', '2018-04-13', 163589);
INSERT INTO employees (name, position, start_date, salary) VALUES('Michaela Cobb', 'ML Engineer', '2018-01-15', 92098);
INSERT INTO employees (name, position, start_date, salary) VALUES('Laura Bright', 'Cloud Architect', '2016-10-29', 115811);
INSERT INTO employees (name, position, start_date, salary) VALUES('Steven Baker', 'SysAdmin', '2016-09-24', 104469);
INSERT INTO employees (name, position, start_date, salary) VALUES('Luis Thomas', 'DevOps Engineer', '2020-06-30', 196223);
INSERT INTO employees (name, position, start_date, salary) VALUES('Margaret Calderon', 'ML Engineer', '2020-12-22', 171752);
INSERT INTO employees (name, position, start_date, salary) VALUES('Shaun Mcknight', 'Backend Developer', '2024-04-07', 106716);
INSERT INTO employees (name, position, start_date, salary) VALUES('Kellie Austin', 'Data Scientist', '2022-10-20', 110747);
INSERT INTO employees (name, position, start_date, salary) VALUES('Matthew Scott', 'SysAdmin', '2023-01-26', 104385);
INSERT INTO employees (name, position, start_date, salary) VALUES('Thomas Phillips', 'DevOps Engineer', '2018-07-04', 148638);
INSERT INTO employees (name, position, start_date, salary) VALUES('Chelsea Lewis', 'ML Engineer', '2019-07-21', 195026);
INSERT INTO employees (name, position, start_date, salary) VALUES('Jason Spears', 'Backend Developer', '2015-08-27', 76946);
INSERT INTO employees (name, position, start_date, salary) VALUES('Corey Hayes', 'Software Engineer', '2018-03-15', 115371);
INSERT INTO employees (name, position, start_date, salary) VALUES('Karen Montoya', 'Data Analyst', '2016-04-18', 174412);
INSERT INTO employees (name, position, start_date, salary) VALUES('Mark Vega', 'Backend Developer', '2020-05-12', 147685);
INSERT INTO employees (name, position, start_date, salary) VALUES('Jessica Collins', 'SysAdmin', '2023-08-17', 158517);
INSERT INTO employees (name, position, start_date, salary) VALUES('Sandra Smith', 'Frontend Developer', '2016-02-17', 138144);
INSERT INTO employees (name, position, start_date, salary) VALUES('Daniel Sanchez', 'QA Engineer', '2022-10-20', 123356);
INSERT INTO employees (name, position, start_date, salary) VALUES('James Lang', 'SysAdmin', '2017-05-31', 154315);
INSERT INTO employees (name, position, start_date, salary) VALUES('Alexander Chapman', 'Software Engineer', '2019-11-01', 151574);
INSERT INTO employees (name, position, start_date, salary) VALUES('Terry Salas', 'QA Engineer', '2015-07-12', 127440);
INSERT INTO employees (name, position, start_date, salary) VALUES('Alejandra Hampton', 'Software Engineer', '2017-08-22', 180475);
INSERT INTO employees (name, position, start_date, salary) VALUES('William Odom', 'SysAdmin', '2024-01-24', 153481);
INSERT INTO employees (name, position, start_date, salary) VALUES('Andrew Bennett', 'DevOps Engineer', '2023-07-31', 164390);
INSERT INTO employees (name, position, start_date, salary) VALUES('James Sullivan', 'Data Scientist', '2024-03-31', 131726);
INSERT INTO employees (name, position, start_date, salary) VALUES('Cassandra Blair', 'Software Engineer', '2021-11-17', 178181);
INSERT INTO employees (name, position, start_date, salary) VALUES('Christine Lewis', 'DevOps Engineer', '2021-05-06', 78845);
INSERT INTO employees (name, position, start_date, salary) VALUES('Lisa Werner', 'Software Engineer', '2015-10-06', 169737);
INSERT INTO employees (name, position, start_date, salary) VALUES('Samantha Howard', 'Backend Developer', '2015-08-03', 188420);
INSERT INTO employees (name, position, start_date, salary) VALUES('Brian Ramirez', 'ML Engineer', '2018-04-29', 134910);
INSERT INTO employees (name, position, start_date, salary) VALUES('Daniel Carter', 'Cloud Architect', '2022-05-25', 89693);
INSERT INTO employees (name, position, start_date, salary) VALUES('Timothy Reyes', 'Cloud Architect', '2017-04-07', 175019);
INSERT INTO employees (name, position, start_date, salary) VALUES('Jasmine Patterson', 'Cloud Architect', '2016-04-15', 101199);
INSERT INTO employees (name, position, start_date, salary) VALUES('Annette Klein', 'SysAdmin', '2016-09-25', 92555);

`3--`
- Connect and Load Data
- Using Python, psycopg2, and Pandas, connect to your cloud database.
- Query the entire employee table and load the data into a Pandas DataFrame.
- Display the first few rows using df.head().

In [24]:
# Connection string
conn_str = "postgresql://neondb_owner:npg_Ppd3S2nUcWfx@ep-steep-rain-a8s0cnp2-pooler.eastus2.azure.neon.tech/neondb?sslmode=require"
# Create SQLAlchemy engine
engine = create_engine(conn_str)
# Query entire employee table and load the data into the dataframe
df = pd.read_sql_query("SELECT * FROM employees;", engine)
# Display the first few records , showing the first 50 records
print(df.head(50))
# Close the engine
engine.dispose()

    employee_id                   name            position  start_date  salary
0             1      Zachary Rogers MD            SysAdmin  2024-01-31  164268
1             2      Francis Castaneda        Data Analyst  2023-04-09   92677
2             3            Oscar Davis      Data Scientist  2019-02-12  114123
3             4            David Brown   Software Engineer  2021-05-11  183617
4             5         Corey Campbell            SysAdmin  2023-07-04   64790
5             6  Dr. Kyle Martinez DDS         ML Engineer  2017-01-11   86908
6             7        Kristin Russell         ML Engineer  2016-12-07   68990
7             8         Patricia Gates   Backend Developer  2018-04-02  140714
8             9          Kelly Carlson            SysAdmin  2019-12-18  107035
9            10        Samantha Hardin     DevOps Engineer  2016-11-04  198378
10           11           Brian Newman         ML Engineer  2019-09-07   94029
11           12      Mikayla Dickerson         ML Engineer  2020-06-20  171252
12           13          Robert Wilson   Backend Developer  2016-11-27   96765
13           14         Zachary Taylor            SysAdmin  2019-03-19  172969
14           15            Brooke Rice            SysAdmin  2015-06-06  114391
15           16          Ashley Arnold            SysAdmin  2021-02-24   85972
16           17            Amber Gould      Data Scientist  2015-01-22  142882
17           18       Christopher Diaz        Data Analyst  2016-06-05  187503
18           19        Travis Marshall   Software Engineer  2015-11-19  122830
19           20              Beth Hart     Cloud Architect  2017-05-28  156517
20           21        Brian Rodriguez     DevOps Engineer  2020-10-29  108627
21           22          Karen Nichols     Cloud Architect  2020-05-18  126015
22           23            Alan Garcia     DevOps Engineer  2020-09-04  124212
23           24           Ryan Winters        Data Analyst  2018-02-25  147986
24           25          Shelby Taylor      Data Scientist  2016-02-11  180404
25           26        Elizabeth Smith     Cloud Architect  2019-09-21   60200
26           27            Marvin Wood     DevOps Engineer  2016-05-05  184470
27           28            Sharon Hall            SysAdmin  2016-11-13  111090
28           29         Tracie Salazar     DevOps Engineer  2019-06-11  194233
29           30            Chris Smith         ML Engineer  2022-05-28  161000
30           31          Todd Anderson      Data Scientist  2020-10-01  104828
31           32           Brandi Casey   Backend Developer  2015-09-11  148238
32           33           Debra Davies  Frontend Developer  2015-04-19   83147
33           34    Samantha Oliver DDS      Data Scientist  2018-07-22   96135
34           35        Christina Floyd  Frontend Developer  2022-02-17  145760
35           36           Luke Griffin         ML Engineer  2019-11-27   88537
36           37           Sara Stewart        Data Analyst  2023-12-05   72123
37           38           Shirley Hart     Cloud Architect  2015-10-19  111158
38           39          Cynthia Reyes   Backend Developer  2019-11-27  102843
39           40           Adam Johnson        Data Analyst  2021-02-23   69521
40           41      Christina Gardner     DevOps Engineer  2022-03-25  172320
41           42           Anna Pittman  Frontend Developer  2023-12-04  198157
42           43             Juan Brown   Backend Developer  2015-06-21  151509
43           44           Brian Levine     Cloud Architect  2015-06-08  111293
44           45         Allison Miller            SysAdmin  2023-11-11  188380
45           46            Sherry Holt        Data Analyst  2018-09-01  169029
46           47          Larry Douglas        Data Analyst  2021-02-05  136119
47           48           Terry Harris     Cloud Architect  2023-03-11  190637
48           49             Seth Chang   Backend Developer  2018-08-18  107043
49           50           Deborah Ford  Frontend Developer  2020-10-04  130907

`3--`
**Explain each EDA step**

**Data Collection**

**`Database Setup and data collection`**
- Go to https://neon.tech/
- Sign up with your GitHub or Google account
- After logging in, click `Create a project`
- Set the project name.
- Choose any region and click `CreateProject`
- Once in the project dashboard page, click on the `connect` button on top right side.
- Copy the connection string
- Select the SQLEditor option , and then copy the SQL query below to create the employees table
- ```SQL
    CREATE TABLE employees (
    employee_id SERIAL PRIMARY KEY,
    name VARCHAR(50),
    position VARCHAR(50),
    start_date DATE,
    salary INTEGER
    );
- Generate 100 asynthetic records using Python and the Faker library. We generate 100 INSERT queries and copy the insert queries.
- Go to project dashboard page and then selected `SQLEditor` and then executed the 100 INSERT queries to insert the data into the cloud database.